app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
    def index
        apartments = Apartment.all

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        apartment = Apartment.find(params[:id])

INSERT INTO "apartments" ("street", "city", "state", "postal_code", "country", "price", "manager_name", "manager_phone", "contact_hours", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
    def create
        apartment = Apartment.create(apartment_params)